In [3]:
import pandas as pd

# Find top 15 amout postion and get the average salary

In [4]:
data = pd.read_csv('salary.csv')

In [5]:
data

     Gender                   Position   Employment status  Total_Salary
0      Male               XR Developer  Full-time employee       27000.0
1    Female                Testmanager  Full-time employee      120000.0
2      Male             Testautomation  Full-time employee       60000.0
3      Male               Test manager  Full-time employee       48400.0
4      Male  Technical project manager  Full-time employee       71000.0
..      ...                        ...                 ...           ...
763    Male          Backend Developer  Full-time employee       50000.0
764    Male          Backend Developer  Full-time employee       75000.0
765    Male          Backend Developer  Full-time employee      130000.0
766    Male          Backend Developer  Full-time employee      170000.0
767    Male          Backend Developer  Full-time employee      142000.0

[768 rows x 4 columns]

In [134]:
pos_sa = data.groupby('Position').mean()

In [135]:
pos = data.groupby("Position").size()

In [136]:
pos = pos.to_frame()

In [137]:
pos = pos.rename(columns = {0:'Count'})

In [138]:
pos.sort_values(by = ["Count"],ascending=False, inplace = True)

In [139]:
pos_cnt_sa = pos.join(pos_sa)

In [140]:
Top15 = pos_cnt_sa.round(0)[:15]

In [117]:
in_list= list(range(1,16))

In [144]:
Top15 = Top15.reset_index()

In [145]:
Top15

               Position  Count  Total_Salary
0     Software Engineer    250       96963.0
1     Backend Developer     97       90434.0
2        Data Scientist     97       90181.0
3    Frontend Developer     51       94143.0
4                DevOps     37       92156.0
5           QA Engineer     36       79600.0
6      Mobile Developer     32       84769.0
7           ML Engineer     27       89074.0
8         Data Engineer     25      135866.0
9       Product Manager     24       93207.0
10         Data Analyst      8       80650.0
11  Engineering Manager      7      130429.0
12     Designer (UI/UX)      6       71633.0
13            Tech Lead      5      127200.0
14   Software Architect      4      124100.0

In [148]:
Top15.to_csv('Top15position.csv',index=False)

# Gender pie chart

In [11]:
data.groupby("Gender").mean().round(0)

         Total_Salary
Gender
Diverse      162000.0
Female        72766.0
Male          98299.0